Revit 2027 API
Glazing.GlazingColorByObject Property
 The property labeled "Color By Object" from the "Glazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GlazingColorByObject { get; }
Public Shared ReadOnly Property GlazingColorByObject As String
	Get
public:
static property String^ GlazingColorByObject {
	String^ get ();
}
static member GlazingColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
Glazing Class
Autodesk.Revit.DB.Visual Namespace